#Создайте словарь person,
# в котором будут присутствовать ключи name, age, city.
# Выведите значение возраста из словаря person

person = {"name":'Denis', 'age:34',"city:Minsk"}
print(person[age])
